### What is Feature Scalling?

Feature scalling is a technique to standardize the independent features present in the data in a fix range

- why: 

je apala independent variable ahe tyancha scale jar same nasel tar machine learning che algorithm cha used kela jato.

- Types of Feature scalling

1. Standardlization  
2. Normalization

.

#### 1. Standardization:

-Also calles as z-score normalization  
-standardization rescales numerical features so that:

Mean = 0  
Standard Deviation = 1 

Example:

üìê Formula  
X_scaled = (X ‚àí Mean) / Std Dev

Example:

Marks = 70  
Mean = 60  
Std = 10

(70‚àí60)/10 = 1

In [ ]:
import pandas as pd
import seaborn as sns
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split

In [ ]:
df= sns .load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
df2 = df[['survived','pclass','age','parch']]
df2.head()

   survived  pclass   age  parch
0         0       3  22.0      0
1         1       1  38.0      0
2         1       3  26.0      0
3         1       1  35.0      0
4         0       3  35.0      0

In [6]:
df3= df2.fillna(df2.mean()) # handling missing values

x= df3.drop("survived", axis=1)
y=df3["survived"]
print('shape of x = ', x.shape)
print('shape of y =', y.shape)

shape of x =  (891, 3)
shape of y = (891,)

#### Train and test

In [8]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=42)  
print('shape of x_train = ', x_train.shape)
print('shape of x_test = ', x_test.shape)
print('shape of y_train = ', y_train.shape)
print('shape of y_test = ', y_test.shape)

NameError: name 'train_test_split' is not defined